***POSTTEST4***

***Nama : Arif WIjaksono***

***Nim : 2109106129***

LinkGoogleDrive:https://drive.google.com/file/d/15ls7zvwLXqwn662OXkCoq7cglbqcf1PS/view?usp=drive_link

***Info Data***

In [2]:
import numpy as np
import pandas as pd
from sklearn.preprocessing import MinMaxScaler, StandardScaler, OneHotEncoder
from sklearn.model_selection import train_test_split
from sklearn.impute import SimpleImputer

df = pd.read_csv('Customer-Churn-Records.csv')
df.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,Complain,Satisfaction Score,Card Type,Point Earned
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1,1,2,DIAMOND,464
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0,1,3,DIAMOND,456
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1,1,3,DIAMOND,377
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0,0,5,GOLD,350
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0,0,5,GOLD,425

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 18 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   RowNumber           10000 non-null  int64
 1   CustomerId          10000 non-null  int64
 2   Surname             10000 non-null  object
 3   CreditScore         10000 non-null  int64
 4   Geography           10000 non-null  object
 5   Gender              10000 non-null  object
 6   Age                 10000 non-null  int64
 7   Tenure              10000 non-null  int64
 8   Balance             10000 non-null  float64
 9   NumOfProducts       10000 non-null  int64
 10  HasCrCard           10000 non-null  int64
 11  IsActiveMember      10000 non-null  int64
 12  EstimatedSalary     10000 non-null  float64
 13  Exited              10000 non-null  int64
 14  Complain            10000 non-null  int64
 15  Satisfaction Score  10000 non-null  int64
 16  Card Type           10000 non-null  object
 17  Point Earned        10000 non-null  int64
dtypes: float64(2), int64(12), object(4)
memory usage: 1.4+ MB

In [3]:
df.shape

(10000, 18)

***Membagi dataset menjadi training set dan testing set dengan proporsi 70:30***

In [4]:
X = df.iloc[:, : -1]
y = df.iloc[:, -1]

X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.3)

print("Dimensi X_train", X_train.shape)
print("Dimensi X_test", X_test.shape)
print("Dimensi y_train", y_train.shape)
print("Dimensi y_test", y_test.shape)

Dimensi X_train (7000, 17)
Dimensi X_test (3000, 17)
Dimensi y_train (7000,)
Dimensi y_test (3000,)

***Lakukan normalisasi data pada salah satu attribute menggunakan Min Max scaler (buatlah copy dataset terlebih dahulu)***

In [5]:
min_max = MinMaxScaler()

# Copy Data
copy1 = df
dataCopy_normalization = copy1[["Satisfaction Score"]]

normalization = min_max.fit_transform(dataCopy_normalization[["Satisfaction Score"]])

df_normalization = pd.DataFrame(normalization)
df_normalization.columns =["Satisfaction Score_Normalization"]

dataCopy_normalization = dataCopy_normalization.join(df_normalization["Satisfaction Score_Normalization"]).reset_index()
dataCopy_normalization = dataCopy_normalization.drop("index", axis=1)

print()
print("Data Sebelum dan Sesudah dilakukan normalisasi : \n")
dataCopy_normalization.head(10)

Data Sebelum dan Sesudah dilakukan normalisasi :

   Satisfaction Score  Satisfaction Score_Normalization
0                   2                              0.25
1                   3                              0.50
2                   3                              0.50
3                   5                              1.00
4                   5                              1.00
5                   5                              1.00
6                   2                              0.25
7                   2                              0.25
8                   3                              0.50
9                   3                              0.50

***Lakukan standarisasi pada dataset (buatlah copy dataset terlebih dahulu)***

In [8]:
# Membuat salinan dataset
data_copy = df.copy()

# memilih atribut yang ingin di standarisasi
attribute_to_standardize = 'Satisfaction Score'

# Inisialisasi StandardScaler
scaler = StandardScaler()

# Standarisasi atribut
data_copy[attribute_to_standardize] = scaler.fit_transform(data_copy[[attribute_to_standardize]])

# Menampilkan atribut 'Satisfaction Score' sebelum dan sesudah standarisasi
print("Atribut 'Satisfaction Score' Sebelum dan Sesudah Standarisasi:\n")
print("Sebelum Standarisasi:\n")
print(df[[attribute_to_standardize]].head(10))
print("\nSesudah Standarisasi:\n")
print(data_copy[[attribute_to_standardize]].head(10))

Atribut 'Satisfaction Score' Sebelum dan Sesudah Standarisasi:

Sebelum Standarisasi:

   Satisfaction Score
0                   2
1                   3
2                   3
3                   5
4                   5
5                   5
6                   2
7                   2
8                   3
9                   3

Sesudah Standarisasi:

   Satisfaction Score
0           -0.721130
1           -0.009816
2           -0.009816
3            1.412812
4            1.412812
5            1.412812
6           -0.721130
7           -0.721130
8           -0.009816
9           -0.009816

***Lakukan Data cleaning pada data dengan nilai null (jika tidak ada nilai null pada dataset, maka buatlah menjadi ada). Ganti nilai null sesuai ketentuan. (bilangan bulat : median/modus, bilangan desimal : mean, tulisan : modus).***

***Nilai Null***

In [9]:
df.isna().sum()

RowNumber             0
CustomerId            0
Surname               0
CreditScore           0
Geography             0
Gender                0
Age                   0
Tenure                0
Balance               0
NumOfProducts         0
HasCrCard             0
IsActiveMember        0
EstimatedSalary       0
Exited                0
Complain              0
Satisfaction Score    0
Card Type             0
Point Earned          0
dtype: int64

In [10]:
# menghapus atribut nilai null
df.dropna(inplace=True) 
df.isna().sum()

RowNumber             0
CustomerId            0
Surname               0
CreditScore           0
Geography             0
Gender                0
Age                   0
Tenure                0
Balance               0
NumOfProducts         0
HasCrCard             0
IsActiveMember        0
EstimatedSalary       0
Exited                0
Complain              0
Satisfaction Score    0
Card Type             0
Point Earned          0
dtype: int64

***Mengubah bilangan bulat menjadi median/modus***

In [11]:
data = pd.read_csv('Customer-Churn-Records.csv')
strategi1 = SimpleImputer(strategy="median")

data["Satisfaction Score"] = strategi1.fit_transform(data[["Satisfaction Score"]])

data.isna().sum()

RowNumber             0
CustomerId            0
Surname               0
CreditScore           0
Geography             0
Gender                0
Age                   0
Tenure                0
Balance               0
NumOfProducts         0
HasCrCard             0
IsActiveMember        0
EstimatedSalary       0
Exited                0
Complain              0
Satisfaction Score    0
Card Type             0
Point Earned          0
dtype: int64

***Mengubah bilangan desimal menjadi mean***

In [14]:
import pandas as pd
data = pd.read_csv('Customer-Churn-Records.csv')
from sklearn.impute import SimpleImputer
strategi2 = SimpleImputer(strategy="mean")

data["CreditScore"] = strategi2.fit_transform(data[["CreditScore"]])

data.isna().sum()

RowNumber             0
CustomerId            0
Surname               0
CreditScore           0
Geography             0
Gender                0
Age                   0
Tenure                0
Balance               0
NumOfProducts         0
HasCrCard             0
IsActiveMember        0
EstimatedSalary       0
Exited                0
Complain              0
Satisfaction Score    0
Card Type             0
Point Earned          0
dtype: int64

***Mengubah tulisan menjadi modus***

In [44]:
import pandas as pd
data = pd.read_csv('Customer-Churn-Records.csv')
# Daftar kolom yang akan diisi dengan modus
kolom_tulisan = ['CustomerId','Surname','CreditScore', 'Geography','Gender', 'Age', 'Tenure', 'Balance','NumOfProducts',]

# Loop melalui kolom-kolom tersebut dan ganti nilai null dengan modus
for kolom in kolom_tulisan:
    modus = data[kolom].mode()[0]  # Mengambil modus kolom
    data[kolom].fillna(modus, inplace=True)

data.isna().sum()

RowNumber             0
CustomerId            0
Surname               0
CreditScore           0
Geography             0
Gender                0
Age                   0
Tenure                0
Balance               0
NumOfProducts         0
HasCrCard             0
IsActiveMember        0
EstimatedSalary       0
Exited                0
Complain              0
Satisfaction Score    0
Card Type             0
Point Earned          0
dtype: int64

***cleaning duplicate***

In [21]:
data[data.duplicated()]

print("Jumlah Data Duplikat : ")
data.duplicated().sum()

Jumlah Data Duplikat :

0

***Karena tidak ada data nilai duplikat maka membuat nilai duplikat***

In [22]:
make_duplicated = pd.concat([data]*2, ignore_index=True)
make_duplicated.duplicated()

print("Jumlah data duplicated sekarang :")
make_duplicated.duplicated().sum()

Jumlah data duplicated sekarang :

10000

In [23]:
make_duplicated.drop_duplicates(inplace=True)

hasil = make_duplicated.reset_index(drop=True)
print("Jumlah data duplicated setelah di drop :")
hasil.duplicated().sum()

Jumlah data duplicated setelah di drop :

0

***Ganti tipe data salah satu attribute angka***

In [24]:
print("Tipe data points sebelum diubah :")
df["Satisfaction Score"].dtypes

Tipe data points sebelum diubah :

dtype('int64')

***Lakukan one hot encoding pada dataset yang kalian miliki***

In [52]:
import pandas as pd
from sklearn.preprocessing import OneHotEncoder
from sklearn.compose import ColumnTransformer

# Membaca dataset
df = pd.read_csv('Customer-Churn-Records.csv')
df.head()

# Inisialisasi OneHotEncoder
encoder = OneHotEncoder(sparse=False)

# Membuat transformer untuk kolom 'Geography'
transformer = ColumnTransformer(
    transformers=[('cat', encoder, ['Geography'])],
    remainder='passthrough'
)

# Melakukan transformasi one-hot encoding pada dataset
encoded_data = transformer.fit_transform(df)

# Mendapatkan nama fitur setelah one-hot encoding
cat_feature_names = list(transformer.named_transformers_['cat'].get_feature_names_out(['Geography']))

# Menggabungkan nama fitur dengan kolom-kolom lainnya
feature_names = cat_feature_names + df.columns.tolist()[1:]

# Membuat DataFrame baru dengan nama fitur
encoded_df = pd.DataFrame(encoded_data, columns=feature_names)

# Menghapus kolom asli 'Geography'
encoded_df.drop(columns=['Geography'], inplace=True)

# Menampilkan HasilHasilnya 
df.head()

C:\Users\LENOVO\AppData\Local\Programs\Python\Python310\lib\site-packages\sklearn\preprocessing\_encoders.py:975: FutureWarning: `sparse` was renamed to `sparse_output` in version 1.2 and will be removed in 1.4. `sparse_output` is ignored unless you leave `sparse` to its default value.
  warnings.warn(

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,Complain,Satisfaction Score,Card Type,Point Earned
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1,1,2,DIAMOND,464
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0,1,3,DIAMOND,456
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1,1,3,DIAMOND,377
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0,0,5,GOLD,350
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0,0,5,GOLD,425